# SetWallPrefStyle

## Description
Set the document default wall preferences to match the Wall Style identified by sysName.

```pascal
FUNCTION SetWallPrefStyle(sysName : STRING) : BOOLEAN;
```

```python

def vs.SetWallPrefStyle(sysName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sysName|STRING||

## Remarks
NZH 5-10-05

## Version
Availability: from VectorWorks12.0
## Category
* Document Settings